Tekla Open API Reference for Tekla Structures 2025
FacetedBrepFace.HasHoles Property
 Gets a value indicating whether this instance has holes.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool HasHoles { get; }
Public ReadOnly Property HasHoles As Boolean
	Get
Property Value
Type: Boolean
See Also
Reference
FacetedBrepFace Class
Tekla.Structures.Geometry3d Namespace